In [1]:
# Import Dependencies
import pandas as pd

In [2]:
# Read in dataset
df = pd.read_csv("Resources/Disposable_Income.csv")
df.head()

         DATE  A229RX0
0  1959-01-01  12440.0
1  1959-02-01  12462.0
2  1959-03-01  12517.0
3  1959-04-01  12581.0
4  1959-05-01  12634.0

In [3]:
# Rename columns
df.rename(columns = {'DATE': 'Date', 'A229RX0':'Income'}, inplace = True)

In [4]:
df.head()

         Date   Income
0  1959-01-01  12440.0
1  1959-02-01  12462.0
2  1959-03-01  12517.0
3  1959-04-01  12581.0
4  1959-05-01  12634.0

In [5]:
# Add in Month column
df['Month'] = pd.DatetimeIndex(df['Date']).month
df.head()

         Date   Income  Month
0  1959-01-01  12440.0      1
1  1959-02-01  12462.0      2
2  1959-03-01  12517.0      3
3  1959-04-01  12581.0      4
4  1959-05-01  12634.0      5

In [6]:
# Add in Month_Year column
df['Month_Year'] = pd.to_datetime(df['Date']).dt.to_period('M')
df.head()

         Date   Income  Month Month_Year
0  1959-01-01  12440.0      1    1959-01
1  1959-02-01  12462.0      2    1959-02
2  1959-03-01  12517.0      3    1959-03
3  1959-04-01  12581.0      4    1959-04
4  1959-05-01  12634.0      5    1959-05

In [7]:
# Write to csv
df.to_csv('Resources/cleaned_disposable_inc.csv')